tutorials/lagrangian/LTSReactingParcelFoam/counterFlowFlame2D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0.1;
    }
    p
    {
        solver           GAMG;

        tolerance        0;
        relTol           0.05;

        smoother         DICGaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;

        cacheAgglomeration true;

        nCellsInCoarsestLevel 10;
        agglomerator     faceAreaPair;
        mergeLevels      1;

        maxIter          50;
    };

    "(U|Yi|hs|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       0;
        relTol          0.1;
    }
}

PISO
{
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    momentumPredictor yes;
    rhoMin rhoMin [1 -3 0 0 0] 0.1;
    rhoMax rhoMax [1 -3 0 0 0] 1.5;
}

additional
{
    eWork           true;
    hWork           true;
    solveSpecies    true;
}


// ************************************************************************* //
